package com.company.SecondLesson.interfaces;

public interface Sequences {

    /**
     * Выводит в консоль n первых членов последовательности B
     * @param n число членов последовательности для вывода
     */
    void firstSequences(int n);
    /**
     * Выводит в консоль n первых членов последовательности B
     * @param n число членов последовательности для вывода
     */
    void secondSequences(int n);
    /**
     * Выводит в консоль n первых членов последовательности B
     * @param n число членов последовательности для вывода
     */
    void thirdSequences(int n);
    /**
     * Выводит в консоль n первых членов последовательности B
     * @param n число членов последовательности для вывода
     */
    void fourthSequences(int n);
    /**
     * Выводит в консоль n первых членов последовательности B
     * @param n число членов последовательности для вывода
     */
    void fifthSequences(int n);
    /**
     * Выводит в консоль n первых членов последовательности B
     * @param n число членов последовательности для вывода
     */
    void sixthSequences(int n);
    /**
     * Выводит в консоль n первых членов последовательности B
     * @param n число членов последовательности для вывода
     */
    void seventhSequences(int n);
    /**
     * Выводит в консоль n первых членов последовательности B
     * @param n число членов последовательности для вывода
     */
    void eightSequences(int n);
    /**
     * Выводит в консоль n первых членов последовательности B
     * @param n число членов последовательности для вывода
     */
    void ninthSequences(int n);
    /**
     * Выводит в консоль n первых членов последовательности B
     * @param n число членов последовательности для вывода
     */
    void tenthSequences(int n);
}
